/**
 * 2019年11月9日19:56:35
 * 
 * 工具：
 * Chrome浏览器市场占用份额最高
 * 开发工具： DWcs6 sublime webstorm hbuilder(国人开发) vscode 
 * PS ：  学习切图
 * 
 * 网页就是：文字 图片 视频 
 * 网页的形成： 前端代码-> 浏览器渲染 -> 客户眼中的页面
 * 
 * 常用浏览器分类： IE 火狐 Chrome Safari 欧朋
 * 重点 ：浏览器内核的概念
 * 分为两部分  渲染引擎和JS引擎  渲染引擎 它负责取得网页的内容（HTML、XML、图像等等）、整理讯息（例如加入 CSS 等），以及计算网页的显示方式，然后会输出至显示器或打印机。浏览器的内核的不同对于网页的语法解释会有不同，所以渲染的效果也不相同。 JS 引擎 则是解析 Javascript 语言，执行 javascript语言来实现网页的动态效果。
最开始渲染引擎和 JS 引擎并没有区分的很明确，后来 JS 引擎越来越独立，内核就倾向于只指渲染引擎。有一个网页标准计划小组制作了一个 ACID 来测试引擎的兼容性和性能。内核的种类很多，如加上没什么人使用的非商业的免费内核，可能会有10多种，但是常见的浏览器内核可以分这四种：Trident、Gecko、Blink、Webkit（现在的苹果和以前的Chrome内核，新的Chrome内核是基于这个二次开发的）。
Android手机浏览器内核使用率最高的也是webKit 或者基于这个二次开发的 苹果手机就不用说了吧

不同浏览器内核对代码的执行渲染效果不同，因此出现了国际标准
Web标准不是某一个标准，而是由W3C和其他标准化组织制定的一系列标准的集合。
主要包括结构（Structure）、表现（Presentation）和行为（Behavior）三个方面。 结构主要学的是HTML 表现CSS 行为JS
 */